src/trade-stock/tests/trade-stock-stress-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: "{{ url }}"
  phases:
    - duration: 500
      arrivalRate: 1
      rampTo: 2
      name: Warm up phase
    - duration: 500
      arrivalRate: 2
      rampTo: 8
      name: Ramp up load
    - duration: 1000
      arrivalRate: 5
      rampTo: 15
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: { }
    apdex: { }
    metrics-by-endpoint: { }
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
              url: "/db-stress/"
              expect:
                - statusCode: 200
        count: 200